{"data":{"site":{"siteMetadata":{"title":"Artūro blogas ir šiaip nuveikti darbai","author":"Artūras"}},"markdownRemark":{"id":"7a8fa0bf-c246-54e8-b307-ac1cf39b4d10","excerpt":"It all started seven-something years ago when I broke up with a girlfriend. It was a complicated relationship for many years - let’s say I…","html":"<p>It all started seven-something years ago when I broke up with a girlfriend. It was a complicated relationship for many years - let’s say I had my ups and downs during it. She always was a free bird. It was fine with me.\nWe could talk, laugh, walk, kiss for hours, and text in hundreds of messages per day about anything but one thing - us.\nMeet the Problem - she didn’t want to commit. Every time I tried to confront her with the issue at hand, she would switch the topic or better - accuse me of being too pushy. Yet then we would laugh it off.</p>\n<p>Enter the change. </p>\n<p>At some point, the dynamic changed. First signals that something had changed when around of company of friends she stared at me as one would stare at a blank space.\nI knew it was over. It hurt me. One day she stopped replying, I got ghosted.\nI get rid of anything that reminds me of her. Social media, phone number, email letters, photos, gift, anything. Gone. Nada.</p>\n<p>Time. I.</p>\n<p>So now I’m all alone with nothing to care about, right? I’m young, smart, good looking, have quite a few friends. It’s not a tragedy, right?\nExcept.\nI could not stop not thinking about her.\nNow all those messages, conversations, and laughs are in my head. Those thoughts always come around at some point in the time of day through all this story. It just happens.\n“You will get over her” - some friends said. I replied reaffirming - “Sure I will”.\nThe first half of the year went quite smoothly. No hookups tho. But still motivated as ever, having fun here and there, doing my job, minding my business. Guess who is spinning on my mind like a broken record?</p>\n<p>Now it starts. </p>\n<p>The day I welcomed her to the city and helped her to move into the dorms I got a job. Now the thing is … my boss reassembles her in a way by her looks and even character. Suddenly some anxiety kicks in. I still do my job but I’m not that enthusiastic anymore. It gets on my nerves.\nMy boss receives flowers and I see how She receives flowers in my head. I don’t want to work there anymore. I quit. Boss asks why and I tell some bullshit lie.   </p>\n<p>And things get messy. (I remember this part very vaguely like through fog)\nI don’t have a job nor savings that would pull me through for a couple of months. I’m anxious. Some debt accumulated during the stay in the flat.\nI met this girl. She’s fine, we talk. I find her attractive so she does. No hookup somehow?<br>\nI have this job interview next Monday. But my brother comes to collect what’s left of me on Saturday. So I skip the interview.\nI move back to my parents for some time.\nWith her on my mind.\nI write to the girl I recently met that she could take my place in the flat and so she did.</p>\n<p>Now it’s getting worse - I can’t think straight, some mental fog and anxiety things are going on in my head. I think to myself that it needs time to get better.\nIn the meanwhile, I found some client work to do from a client named the same as her … are you kidding me? I’m trying to forget her here! Hello!?\nI finish the job but didn’t get paid in full. Doesn’t matter nevertheless.\nSent over a couple of CV’s to local companies and got invited to interview. Got the job even though the mental fog and anxiety. Winning in a sense.</p>\n<p>Now she’s trying to contact me by calling. I’m still trying to forget her. I answer and ask to delete the number.</p>\n<p>Back to the job. Except I could not do my job there. Either I wasn’t in my mental capacity, either the managers could not do their job of describing the task for me. So off I go back to the drawing board.\nRemember the Job interview that I had on a Monday before I took off for a parent’s place? They invited me again for the interview. How cool huh?  Went there and got the job.\nNow I’m staying temporarily at my friend’s. They see that something is off with me. </p>\n<p>Enter the new workplace.</p>\n<p>It’s a nice big company. I did my work that was assigned, finished my project. Had a bad day and got slacked. Why? I don’t know. Pixel was missing they say. I blame it on my mental state.\nBack to the parents off we go. My work went into production tho.</p>\n<p>Now I’m considering finishing my university education. The business school where I left around two years ago? Nope. She’s there because I recommended her that place to her and she took the advice.  I went as far as walking her down by the hand to sign the contract there. </p>\n<p>I took another faculty. Maths. I didn’t do any research on where I am going. As long I am moving to somewhere and not getting stuck at parents. I got in.\nRegret came in in no time. It wasn’t my place.\nNow mix maths with anxiety, sadness, and constant thought about her (2+ years past by). How’s the mix?  Having fun yet? Now combine it with the morgue in front of your dorm room window and shake it for two additional years. Don’t forget to add the absence of intimate life.\nIt didn’t get better.\nI didn’t reach out to my friends or anyone. I was afraid.\nI knew nowhere to go. I could not think straight nor reason about anything. Most of the time I wanted to die. I stared at the wall. My head was empty and full.  Sometimes I pathetically cried myself to sleep with a wish I would not wake up. I was going to the faculty screaming and shouting in my mind. I thought I was going insane. And on the outside, no one even asked if I am doing good? Maybe my act was good. maybe everyone there felt the same.\nI had sex once a year up to this point at most. Mostly one night stands.\nAt some point, the few girls that there were at the math faculty for some reason got attracted to me? I got into some casual relationships that I could not maintain for a long time. The sex fixed some issues for me. But not the ‘her’ one. Now I’m tindering here and there and having a bunch of action.\nIt made me realize that I need help. So I went to a therapist. I told everything but one thing I could not talk about. It was still on my mind.  However, I felt better now.</p>\n<p>Fast forward three more years.\nThere were few events like living without Facebook for two years, some travel abroad, ups and downs, gigs, etc.\nI had dozens of one night stands, maybe even some std (one girl warned me, wasn’t true), at least four relationships that lasted longer than a month. Some therapy sessions. I’m still thinking about her.</p>\n<p>It’s a month since my last ‘relationship’.</p>\n<p>I open some social media. Scroll for job openings. Now I see her as some of the post creators. I switch tabs, and I see more of her. I pick up the courage and said hi to her through the chat. I dont’t feel that anxiety or distres. She instantly replied. She even offered to meet for closure.<br>\nWe met.\nSuddenly she’s talking about us how she felt when she left me and why and even answered some of my questions? WHAT?\nWe separated after 2 hours of walking-talking. I still felt something for her.</p>\n<p>I had insomnia that night. All those flashbacks and thoughts from the events that happened during the seven years came in one night. In the end, I had a panic attack. I was recording the feelings that I was experiencing throughout the night.\nAnd I ruined everything in the morning by sharing those notes with her. </p>\n<p>The end.</p>","frontmatter":{"title":"Closrure Or It is what it is.","date":"December 04, 2020"}}},"pageContext":{"slug":"/closure/","previous":{"fields":{"slug":"/new-company/"},"frontmatter":{"title":"New company"}},"next":{"fields":{"slug":"/first-package/first-package/"},"frontmatter":{"title":"First NPM package published"}}}}